In [ ]:
# Load some libraries we need
import pandas as pd
%load_ext google.colab.data_table
import sqlite3 as sql

In [ ]:
# Mount Goole Drive
from google.colab import drive
drive.mount('/content/gdrive', force_remount=True)
% cd gdrive/MyDrive/Colab\ Notebooks

Mounted at /content/gdrive
/content/gdrive/MyDrive/Colab Notebooks

In [ ]:
# We connect to the database
# Be careful to the path, better to copy/paste it
db_conn = sql.connect("/content/gdrive/MyDrive/hyper_jobs.db")

In [ ]:
#jobs
pd.read_sql(
    """
     select * from jobs limit 5
        
    """, db_conn
)

   id           created_at  ... rating_to_worker  rating_to_employer
0   1  2020-12-22 00:00:00  ...              5.0                 5.0
1   2  2020-12-22 00:00:00  ...              1.0                 2.0
2   3  2020-12-22 00:00:00  ...              1.0                 2.0
3   4  2020-12-22 00:00:00  ...              NaN                 NaN
4   5  2020-12-22 00:00:00  ...              3.0                 2.0

[5 rows x 11 columns]

In [ ]:
#level 1: list all workers that are graphic designers
pd.read_sql(
    """
     select distinct booked_worker
     from jobs 
     where role_id=1 and booked_worker is not null
     --group by 1
     limit 3   
    """, db_conn
)

   booked_worker
0             16
1             15
2             12

In [ ]:
#level 2: calculate the number of worked jobs for each of the graphic designers
pd.read_sql(
    """
     select distinct booked_worker,count(distinct id)
     from jobs 
     where role_id=1 and booked_worker is not null
     group by 1
     limit 3   
    """, db_conn
)

   booked_worker  count(distinct id)
0              2                  22
1             12                  30
2             15                  25

In [ ]:
#level 3: calculate the average number of jobs per worker, worked by graphic designers
pd.read_sql(
    """
     
     with workedjobsbyGD as
     (
     select distinct booked_worker,count(distinct id) as workedjobs
     from jobs 
     where role_id=1 and booked_worker is not null
     group by 1
     )
     select round(avg(workedjobs)) as AvgNoOfJobsPerWorker from workedjobsbyGD
    """, db_conn
)

   AvgNoOfJobsPerWorker
0                  13.0

In [ ]:
#workers
pd.read_sql(
    """
     select * from workers limit 5
        
    """, db_conn
)

   id first_name   last_name        date_of_birth           created_at  role_id
0   1       Yale     Dobbins  1997-04-18 00:00:00  2020-12-01 00:00:00        2
1   2     Easter     Sollime  1992-12-25 00:00:00  2020-12-02 00:00:00        1
2   3      Irwin     Hissett  1980-07-22 00:00:00  2020-12-03 00:00:00        5
3   4   Franklyn      Dabner  1999-10-01 00:00:00  2020-12-04 00:00:00        2
4   5   Stefania  Shropshire  1990-03-15 00:00:00  2020-12-05 00:00:00        4

In [ ]:
#roles
pd.read_sql(
    """
     select * from roles limit 5
        
    """, db_conn
)

   id             title  industry_id  min_hour_pay_rate
0   1  graphic_designer            1                 11
1   2      web_designer            1                 12
2   3       ui_designer            1                 12
3   4  content_designer            1                 14
4   5   visual_designer            1                 11